       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADDNUM.
       DATA DIVISION.
       LINKAGE SECTION.
       01 A PIC S9(9) COMP-5.
       01 B PIC S9(9) COMP-5.
       01 RESULT PIC S9(9) COMP-5.
       PROCEDURE DIVISION USING A B RESULT.
       MAIN-PROCEDURE.
           ADD A TO B GIVING RESULT.
           GOBACK.
       END PROGRAM ADDNUM.
      