       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBNUM.
       DATA DIVISION.
       LINKAGE SECTION.
       01 A PIC S9(9) COMP-5.
       01 B PIC S9(9) COMP-5.
       01 RESULT PIC S9(9) COMP-5.
       PROCEDURE DIVISION USING A B RESULT.
       MAIN-PROCEDURE.
           SUBTRACT B FROM A GIVING RESULT.
           GOBACK.
       END PROGRAM SUBNUM.